from sentence_transformers import SentenceTransformer

model = SentenceTransformer(
    "jinaai/jina-embeddings-v3",
    trust_remote_code=True
)

raw_texts = [
    "Ерөнхий сайд Г.Занданшатар: Эхний сайн мэдээ гэвэл НӨАТ-ын буцаан олголтыг 5% болгоно. Хоёр жилийн өмнө иргэдийн өргөн дэмжлэг авсан энэ санаачилгыг би Ерөнхий сайдын хувиар хэрэгжүүлнэ. Хоёр дахь сайн мэдээ бол 2026 оны улсын төсвийг зөвхөн албан тушаалтнууд биш та бүхэнтэйгээ хамтран боловсруулна. Таны санал хамгийн үнэ цэнтэй гэв.",
    "Нэмэгдсэн өртөгт ногдуулсан татвар нь үйлдвэрлэгчээс худалдан авахад төлөх татвар юм. Энэ татварыг үйлдвэрлэгчээс худалдан авагчид хүргүүлсэн нэхэмжлэхээр тусгайд нь харуулдаг. 2024 оны НӨАТ-ын нийт дүн 1.1 их наяд төгрөг байв. Энэ оны эхний хагас жилийн НӨАТ-ын дүн нэг их наяд, 80 тэрбум 300 сая төгрөг байна.",
    "Монголын үндэсний бөхийн холбооноос наймдугаар сард зохион байгуулах бөхийн барилдааны хуваарийг танилцууллаа. 08.02 Бямба 11:00. Хөлийн голын тохойд /Хонхор/ Төмөр замчдын баярын хүчит 64 бөхийн барилдаан 08.08-08.10 Баасан-Бямба. Хүй долоон худагт \"Их хурд-10\" наадмын хүчит 256 бөхийн барилдаан тус тус болно"
]

embedded_vectors = model.encode(raw_texts)
print(embedded_vectors.shape)
print(embedded_vectors)